{
  "backend/main.mo": "Motoko actor implementing products, orders, and user profile management with access control and CRUD operations.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind base/styles defining theme variables and light/dark color tokens using OKLCH.",
  "frontend/index.html": "Root HTML file loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Defines TanStack Router setup, routes, and root component handling profile‑setup logic.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Protects admin routes by checking auth state and redirecting unauthorized users.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with query cache clearing.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Modal prompting new users for their name and saving their profile.",
  "frontend/src/components/catalog/CatalogFilters.tsx": "Sidebar filters for sorting, category selection, and price range inputs.",
  "frontend/src/components/catalog/ProductCard.tsx": "Clickable product card showing image, info, stock, and add‑to‑cart actions.",
  "frontend/src/components/common/Price.tsx": "Formats a numeric or bigint amount into a USD currency string and displays it in a span.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with branding and a link to caffeine.ai.",
  "frontend/src/components/layout/StoreLayout.tsx": "Page layout wrapper providing top navigation, main content area, and footer.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar with logo, catalog links, admin link, login button, and cart indicator.",
  "frontend/src/components/product/QuantityPicker.tsx": "A control for adjusting numeric quantities with buttons and direct input, enforcing min/max limits.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAuth.ts": "Determines authentication and admin status using the actor and Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating products, orders, and user profiles via the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining the site's color palette and layout utilities.",
  "frontend/src/main.tsx": "Initializes React with QueryClient and InternetIdentity providers and renders the App.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Displays an access denied message with navigation back to home inside the store layout.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin UI for listing products and creating, editing, and deleting them using dialog forms and query hooks.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart, allowing item quantity updates, removal, clearing the cart, and navigating to checkout or catalog.",
  "frontend/src/pages/CatalogPage.tsx": "Displays a product catalog with filtering, sorting, audience selection, and category-based browsing using mapped storefront product data.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow including shipping form, order submission, error handling, and storing order data before redirecting to confirmation.",
  "frontend/src/pages/HomePage.tsx": "Shows a hero banner and collection previews that link users to catalog pages filtered by audience.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Reads stored order details, displays purchased items and shipping info, and provides a link to return home.",
  "frontend/src/pages/ProductDetailPage.tsx": "Fetches and displays a single product with audience/category metadata, allows quantity selection, and adds the product to the cart.",
  "frontend/src/state/cart.ts": "Zustand cart store handling add/remove/update operations, totals, and sessionStorage persistence with bigint parsing.",
  "frontend/src/types/storefront.ts": "Type definitions for storefront entities including products, cart items, filters, sorting, and shipping info.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters and session-stored values, supporting hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, fonts, animations, and plugin setup for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing state, features, and a pending request to support product updates."
}